app/controllers/concerns/Lists_Controller.rb

  def set_list
    @list = List.find(params[:id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]